export const fuelTypeMap: Record<number, string> = {
    2: "ბენზინი",
    3: "დიზელი",
    7: "ელექტრო",
    6: "ჰიბრიდი",
    10: "დატ. ჰიბრიდი",
    9: "თხევადი გაზი",
    8: "ბუნებრივი გაზი",
    12: "წყალბადი",
};

export const gearTypeMap: Record<number, string> = {
    1: "მექანიკა",
    2: "ავტომატიკა",
    3: "ტიპტრონიკი",
    4: "ვარიატორი",
};

export const bodyTypeMap: Record<number, string> = {
    0: "სედანი",
    1: "ჰეჩბეკი",
    2: "კუპე",
    3: "კონვერტიბლი",
    4: "უნივერსალი",
    5: "ჯიპი",
    6: "მინივენი",
    7: "პიკაპი",
    8: "კაბრიოლეტი",
    9: "ვაგონი",
};
